{"id": 1, "part": "Part1", "question": "What is your favorite food?", "base_answer": "My favorite food is chocolate.", "upgraded_answer": "To be honest, I have a strong craving for dark chocolate, primarily because I'm a big fan of its rich, velvety texture and the slightly bitter aftertaste."}
{"id": 2, "part": "Part1", "question": "What kind of food did you like when you were young?", "base_answer": "My favorite food has become chocolate.", "upgraded_answer": "As I've grown older, my palate has evolved. While I used to have a sweet tooth for pudding back in my childhood, I now prefer the complex flavors of dark chocolate to relieve stress."}
{"id": 3, "part": "Part1", "question": "What's your favorite animal? Why?", "base_answer": "Dogs are loyal and will love you forever.", "upgraded_answer": "What strikes me most about dogs is their unwavering loyalty. They provide constant companionship, which is a great comfort in today's fast-paced society."}
{"id": 4, "part": "Part1", "question": "Where do you prefer to keep your pet, indoors or outdoors?", "base_answer": "I prefer keeping my pet indoors because Nanjing is cold.", "upgraded_answer": "I lean towards keeping pets indoors, particularly given Nanjing's biting cold in winter. It's a matter of animal welfare to ensure they have a cozy and secure environment."}
{"id": 5, "part": "Part1", "question": "Have you ever been part of a sports team?", "base_answer": "I was part of the provincial swimming team.", "upgraded_answer": "Being a member of the provincial swimming team was a pivotal experience for me. It taught me the importance of self-discipline and persistence from a very young age."}
{"id": 6, "part": "Part1", "question": "What are the differences between team sports and individual sports?", "base_answer": "Team sports mean you have teamwork.", "upgraded_answer": "The core appeal of team sports lies in synergy. It's not just about individual skill; it's about how players coordinate to achieve a collective goal."}
{"id": 7, "part": "Part1", "question": "Do you like getting up early in the morning?", "base_answer": "I get up at 8 am to get 8 hours of sleep.", "upgraded_answer": "Actually, no. I stick to a regular sleep cycle, usually waking up at 8 am. This ensures I'm fully refreshed and have enough mental energy to tackle my daily tasks."}
{"id": 8, "part": "Part1", "question": "What do you usually do in the morning?", "base_answer": "I drink coffee because it can awaken me.", "upgraded_answer": "A morning cup of coffee is an essential ritual for me. The caffeine boosts my alertness, helping me shake off grogginess and focus on my studies."}
{"id": 9, "part": "Part1", "question": "Have you ever sent handmade gifts to others?", "base_answer": "I drew a painting for my friend.", "upgraded_answer": "Since I was on a tight budget back in middle school, I opted for a handmade painting. I believe it carried more sentimental value than any pricey, store-bought gift."}
{"id": 10, "part": "Part1", "question": "Have you ever received a great gift?", "base_answer": "I use the wristband to record exercise data.", "upgraded_answer": "Yes, my best friend gifted me a fitness tracker on my 20th birthday. This wearable device allows me to monitor my fitness metrics in real time, which is incredibly useful for optimizing my workout routine."}
{"id": 11, "part": "Part1", "question": "Do you prefer to read on paper or on a screen?", "base_answer": "Paper can help me concentrate better.", "upgraded_answer": "I have a strong preference for physical books as they facilitate deep reading. Unlike digital screens, paper doesn't subject me to constant notifications or digital distractions."}
{"id": 12, "part": "Part1", "question": "Do you prefer scanning or detailed reading?", "base_answer": "Scanning can help me build a framework.", "upgraded_answer": "In academic settings, I find skimming to be a highly efficient strategy. It allows me to identify the key arguments and the overall trajectory of a text within seconds."}
{"id": 13, "part": "Part1", "question": "Do you walk a lot?", "base_answer": "I prefer riding a bicycle instead of walking.", "upgraded_answer": "Actually, no. Cycling is my preferred mode of transport. Not only is it more efficient for short commutes, but it's also a low-carbon way to stay active."}
{"id": 14, "part": "Part1", "question": "Why do people like to walk in parks?", "base_answer": "It can help me escape from busy life.", "upgraded_answer": "Strolling around a park provides a tranquil escape from the urban hustle and bustle. It's the perfect way to clear my mind and reconnect with nature."}
{"id": 15, "part": "Part1", "question": "Do you prefer typing or handwriting?", "base_answer": "Typing is more convenient than handwriting.", "upgraded_answer": "Typing offers unmatched convenience, especially for editing and organizing large volumes of information. It's an indispensable tool for my academic research."}
{"id": 16, "part": "Part1", "question": "Do you look out the window at the scenery when travelling by bus or car?", "base_answer": "I see the scenery quickly slide before my eyes.", "upgraded_answer": "I'm often mesmerized by the fleeting landscapes outside the window. Watching the world whiz by gives me a unique sense of inner peace."}
{"id": 17, "part": "Part1", "question": "Do you prefer the mountains or the sea?", "base_answer": "The sea has diverse mystery marine species.", "upgraded_answer": "I've always been drawn to the ocean. It remains a mysterious frontier, teeming with exotic marine life. I'm fascinated by the biodiversity of the deep sea."}
{"id": 18, "part": "Part1", "question": "Do you take photos of buildings?", "base_answer": "I took a photo for its weird appearance.", "upgraded_answer": "Yes, I'm often compelled to capture iconic structures on camera, especially those with avant-garde or unique architecture. It's a way of documenting the urban silhouette."}
{"id": 19, "part": "Part1", "question": "At what age do you think people are the happiest?", "base_answer": "People need to establish himself in thirties.", "upgraded_answer": "In my view, the thirties might be the prime of life. As the old saying goes, \"a man should be independent at thirty,\" which implies reaching financial stability and maturity."}
{"id": 20, "part": "Part1", "question": "Do you have any plans for the next five years?", "base_answer": "I plan to finish my graduate lessons.", "upgraded_answer": "My primary objective over the next few years is to complete my postgraduate studies and transition into a career where I can apply my research skills."}
