{"id":1,"part":"Part2","part2_topic":"person_place","question":"Describe a person you know who enjoys growing plants.","base_answer":"When it comes to someone who truly enjoys growing plants, I'd like to bring up my mom. She's a full-time housewife, and gardening is one of her hobbies. Although she never studied it professionally, she knows a lot about vegetables. If I remember correctly, she started growing plants seriously about five years ago. At first, she just bought a few pots of flowers from local markets. But over time, she learned more by watching videos online. I still remember one spring; she planted cherry tomatoes in plastic containers. She watered them every day and carefully took care of them. Her hard work finally paid off, and the tomatoes turned out really sweet and juicy. As for the reasons why she enjoys it so much, I guess it's because gardening helps her relax and gives her a sense of achievement. What's more, the vegetables she grows are totally organic, which are healthy and safe.","upgraded_answer":""}
{"id":2,"part":"Part2","part2_topic":"object_concrete","question":"Describe an old thing that your family has kept for a long time.","base_answer":"When it comes to an old thing that my family has kept for a long time, I'd like to talk about a toy car from my childhood. It was a small electric car that a child could actually sit in and drive. It could also be controlled by a remote and it made a sound because it was designed like a police car. My family first got it for me when I was very young as a special gift. We have kept it for many years, and even though I can't fit in it now, we still keep it at home. I still remember how excited I was when I first received it. I used to sit in it and drive around slowly, and sometimes my parents would use the remote control to help me. I liked it so much because it felt like a real car and it made playing much more fun and realistic. This toy is important to my family because it reminds us of my childhood, it brings back many happy memories, and it shows how much my parents cared about making my childhood special.","upgraded_answer":""}
{"id":3,"part":"Part2","part2_topic":"object_concrete","question":"Describe a piece of technology (not a phone) that you would like to own.","base_answer":"When it comes to a piece of technology I'd like to own, I'd like to talk about a basketball shooting machine. It's a training device that can pass the ball back to you automatically. It usually costs several thousand Chinese yuan depending on the model. I first learned about it from videos online, and I also saw some professional players using it during practice, so I immediately thought it looked very useful. The machine can collect the ball and pass it back to you, so you can keep shooting without stopping. I'd like to own it because it would make my basketball training much more efficient. For example, when I practice three-point shots, I normally have to run to pick up the ball, go back to the line, and repeat the same move again and again. With the shooting machine, I could focus only on shooting and improving my moves. I think having this machine would save time and energy, and I could practice more shots in a shorter time, which is why I really want to have one.","upgraded_answer":""}
{"id":4,"part":"Part2","part2_topic":"object_abstract","question":"Describe a story you have read recently.","base_answer":"When it comes to a story that I have read recently, I would like to talk about The Boy Who Cried Wolf. It is a very well-known story and I reread it not long ago when I was reviewing some classic stories. The story is about a young boy who looks after sheep. Out of boredom, he keeps lying to villagers by shouting that a wolf is coming. Each time people rush to help him, only to find out that it's a joke. After several lies, when a real wolf finally appears, no one believes him anymore and all his sheep are attacked. I do like this story, even though it's simple. What I learned from it is the importance of honesty. Once people lose trust, it's very hard to get it back. The story reminds me that even small lies can have serious consequences. That's why I think this old story is still meaningful nowadays.","upgraded_answer":""}
{"id":5,"part":"Part2","part2_topic":"storyline","question":"Describe a time when someone apologized to you.","base_answer":"When it comes to a time when someone apologized to me, I'd like to talk about my dad apologizing to me a few weeks ago at home. I was busy having my classes, so I asked him to walk the dog. He had promised to do so, so I left for my classes as scheduled. However, it turned out that he got distracted by a phone call from his work and completely forgot about his promise. Unfortunately, my puppy couldn't hold it any longer. When I came back home, I found that the dog had pooped right in the middle of my bed. I was so angry and called my dad. When he realized what had happened, he felt extremely guilty. He came home and apologized to me sincerely. He admitted that it was totally his fault. To make up for it, he helped wash the dirty sheets and replaced them with a new set for me. Since my dad worked so hard to clean up the mess and he was busy with his work, which was understandable, I decided to accept his apology and felt much better after he did so much.","upgraded_answer":""}
{"id":6,"part":"Part2","part2_topic":"storyline","question":"Describe the first time you tried an exciting activity.","base_answer":"If I remember correctly, I'd like to talk about the first time I tried skiing. I was born in Nanjing, a southern city, but then I went to Tianjin for university. I realized there were many ski resorts around Tianjin, so one weekend my friend invited me to an indoor ski slope. Before hitting the slopes, I had to suit up with proper ski gear, including a thick ski suit, boots, and a helmet. At first, I was quite confident because I was good at skateboarding when I was a kid, and I guessed they required the same body control and balance. However, things turned out to be different when I started sliding down. I kept falling over and over again. It was then I realized skiing is totally different from skateboarding since it's more slippery and there are no wheels on the board. Luckily, my friend who is a local and an expert skier gave me some tips on how to control my body. After practicing for a while, I finally managed to ski smoothly. The sense of speed was incredible. I want to try it again because it's a great way to challenge myself and have fun during winter.","upgraded_answer":""}
